docs/inclass00.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 16:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 0</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 0</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org29d6ecf">1. Instructions</a></li>
<li><a href="#orgb794da5">2. Links</a></li>
</ul>
</div>
</div>


<div id="outline-container-org29d6ecf" class="outline-2">
<h2 id="org29d6ecf"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Work with your group. Your group assignment is on Piazza. (You might decide to change groups later, but for today, stick with this group.) When we invoke the BB break-out function, nagivate to your assigned group.
</p>

<ol class="org-ol">
<li>Your group should spend a few minutes getting acquainted. Explain a bit about yourself: full-time student?, working in  software development?, why are you taking this class?, favorite/least favorite thing about writing software?, etc.</li>
<li>Decide on a mechanism for joint communication. Google docs? IDE with screen share? Something else?</li>
</ol>

<p>
Now address a technical topic. This exercise touches on some of the thorny issues in data abstraction and inheritance. There is a lot going on in this example. Hence don't worry if it seems confusing today. We'll revisit this example several times over the course of the semester.
</p>

<p>
Consider the following (textbook) code:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">User</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">User</span> (<span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>) { <span style="color: #859900; font-weight: bold;">this</span>.name = name; }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
       <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> User)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;
       <span style="color: #859900; font-weight: bold;">return</span> ((<span style="color: #b58900; font-style: italic;">User</span>) obj).name.equals(<span style="color: #859900; font-weight: bold;">this</span>.name);
    }
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">other methods omitted</span>
}
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">SpecialUser</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900; font-style: italic;">User</span> {
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">id</span>;
    <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">SpecialUser</span> (<span style="color: #b58900; font-style: italic;">String</span> <span style="color: #268bd2;">name</span>, <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">id</span>) { <span style="color: #859900; font-weight: bold;">super</span>(name); <span style="color: #859900; font-weight: bold;">this</span>.id = id; }
    <span style="color: #6c71c4; font-weight: bold;">@Override</span> <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">equals</span> (<span style="color: #b58900; font-style: italic;">Object</span> <span style="color: #268bd2;">obj</span>) {
       <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #268bd2; font-weight: bold;">!</span>(obj <span style="color: #859900; font-weight: bold;">instanceof</span> SpecialUser)) <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #6c71c4; font-weight: bold;">false</span>;
       <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">super</span>.equals(obj) &amp;&amp; ((<span style="color: #b58900; font-style: italic;">SpecialUser</span>) obj).id == <span style="color: #859900; font-weight: bold;">this</span>.id;
    }
    <span style="color: #96A7A9; font-style: italic;">// </span><span style="color: #96A7A9; font-style: italic;">other methods omitted</span>
}
</pre>
</div>

<ol class="org-ol">
<li>Walk though the execution of the <code>equals()</code> method in class <code>User</code> for a few well-chosen objects as the parameter. What happens at each point in the execution?</li>
<li>What does it mean for an <code>equals()</code> implementation to be <b>correct</b>? How do you know? Be as concrete as you can.</li>
<li>Is the given implementation of <code>equals()</code> in class <code>User</code> correct? Again, be concrete. If there is a problem, find a specific object (test case!) that demonstrates the problem.</li>
<li>How does inheritance complicate the correctness discussion for <code>equals()</code> in class <code>SpecialUser</code>?</li>
<li>What is your assessment of the <code>equals()</code> method in the <code>SpecialUser</code> class?</li>
</ol>
</div>
</div>


<div id="outline-container-orgb794da5" class="outline-2">
<h2 id="orgb794da5"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
